Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_2_calculating_your_pension_under_bi_lateral_social_security_agreements.html.txt.tmx
Source language: en
Languages: ga

source: Case study 2: Calculating your pension under bilateral social security agreements
ga: Cás-staidéar 2: Do phinsean a ríomh faoi chomhaontuithe déthaobhacha slándála sóisialaí

source: This is an example showing how your entitlement to State Pension (Contributory) is calculated under bilateral social security agreements
ga: Léiríonn an sampla seo conas a dhéantar do theidlíocht ar Phinsean Stáit (Ranníocach) a ríomh faoi chomhaontuithe déthaobhacha slándála sóisialaí

source: Mary worked in Ireland for just over 11 years and has 600 Irish contributions
ga: Bhí Mary ag obair in Éirinn ar feadh díreach os cionn aon bhliain déag agus tá 600 ranníocaíocht Éireannach aici

source: She has spent the last 23 years working in the US and has 1,200 contributions paid there
ga: Chaith sí 23 bliain ag obair sna Stáit Aontaithe agus tá 1,200 ranníocaíocht aici ansin

source: She will be 66 next month and has returned to Ireland to retire
ga: Beidh sí 66 bliain d’aois an mhí seo chugainn agus tá sí tar éis filleadh ar Éirinn chun dul ar scor

source: She wants to know if she will qualify for the State Pension (Contributory) when she is 66 years of age
ga: Teastaíonn uaithi a fháil amach an mbeidh sí i dteideal Pinsean Stáit (Ranníocach) a fháil nuair a bheidh sí 66 bliain d’aois

source: Mary's yearly average number of contributions is 18
ga: Ríomh an ‘ráta barúlach pinsin’ atá ag Mary

source: Calculate Mary’s 'notional rate of pension'. This is the rate of State Pension Mary would be entitled to if all her contributions were assessed as Irish contributions
ga: Is éard atá ann ná ráta an Phinsin Stáit (Ranníocach) a bheadh Mary i dteideal a fháil dá ndéanfaí a ranníocaíochtaí ar fad a mheasúnú mar ranníocaíochtaí Éireannacha

source: To find the notional rate of pension, calculate the total of all Mary’s contributions (both foreign and Irish) and divide it by the number of years worked in Ireland and abroad
ga: Chun an ráta barúlach pinsin a fháil, ríomh líon iomlán na ranníocaíochtaí ar fad atá ag Mary (idir ranníocaíochtaí eachtracha agus ranníocaíochtaí Éireannacha) agus roinn é faoi líon na mblianta a d’oibrigh sí in Éirinn agus thar lear

source: Total of all Mary's assessable contributions: 600 + 1200 = 1,800 contributions
ga: Líon iomlán na ranníocaíochtaí inmheasúnaithe ar fad atá ag Mary: 600 + 1200 = 1,800 ranníocaíocht

source: Total number of years since entering into insurable employment to the end of the last complete tax year before reaching pension age: 34 years
ga: Líon iomlán na mblianta a oibríodh: 11 bhliain in Éirinn agus 23 bliain i Stát Aontaithe Mheiriceá = 34 bliain

source: Total number of contributions by the number of years worked: 1800 ÷ 34 = 52.9
ga: Líon iomlán na ranníocaíochtaí roinnte faoi líon na mblianta a oibríodh: 1800 ÷ 34 = 52.9

source: Mary’s yearly average number of contributions is 52.9
ga: Is é meánlíon na ranníocaíochtaí bliantúla atá ag Mary ná 52.9

source: Mary’s notional rate of pension is the maximum rate because she has a yearly average contribution of 52.9
ga: Is ionann an ráta barúlach pinsin atá ag Mary agus an t-uasráta toisc go bhfuil ranníocaíocht bhliantúil ar an meán de 52.9 aici

source: This is more than the required yearly average of 48 for the maximum State Pension (Contributory)
ga: Tá sé seo níos airde ná an 48 ranníocaíocht bhliantúil ar an meán a theastaíonn chun an Pinsean Stáit (Ranníocach) uasta a fháil

source: Therefore, her notional rate of pension is the same as the maximum rate of State Pension (Contributory) of €233.30
ga: Dá bhrí sin is ionann a ráta barúlach pinsin agus ráta uasta an Phinsin Stáit (Ranníocach) de €230.30

source: Find out the current rate of State Pension based on yearly average contributions
ga: Faigh amach cad é ráta an Phinsin Stáit (Idirthréimhseach) bunaithe ar mheánlíon do ranníocaíochtaí bliantúla

source: Then apply the formula (A x B) ÷ C = rate of State Pension
ga: Ansin cuir an fhoirmle seo a leanas i bhfeidhm: (A x B) ÷ C = ráta an Phinsin Stáit (Ranníocach)

source: A = the notional rate of pension
ga: A = an ráta barúlach pinsin

source: B = the number of Irish contributions
ga: B = líon na ranníocaíochtaí Éireannacha

source: C = total number of contributions (Irish and foreign)
ga: C = líon iomlán na ranníocaíochtaí (Éireannacha agus eachtracha)

source: You take the figure for the notional rate of pension and multiply by the total number of Irish contributions (B):
ga: Tógann tú an figiúr don ráta barúlach pinsin agus déanann tú é a iolrú faoi líon iomlán na ranníocaíochtaí Éireannacha (B):

source: €233.30 x 600 = €139,980
ga: €230.30 x 600 = €138,180

source: Next, divide €139,980 by the total number of Irish and US contributions which we calculated earlier to be 1800:
ga: Ansin déan €138,180 a roinnt faoi líon iomlán na ranníocaíochtaí Éireannacha agus Meiriceánacha a ríomhamar níos luaithe mar 1800:

source: Mary’s rate of State Pension (Contributory) would be €77.76
ga: Is é an ráta Pinsin Stáit (Idirthréimhseach) atá ag Mary ná €76.76
